{
  "state": "New Jersey",
  "testimonials": [
    {
      "author": "David M. Fried",
      "city": "Chatham",
      "testimonial": [
        "I am a plaintiff's personal injury attorney in New Jersey.&nbsp; I have handled hundreds of complex personal injury and medical malpractice cases in over 30 years of practice.&nbsp; In that time, a large number of my cases have gone to mediation-many of which were successfully resolved, but some were not.&nbsp; I recently had a medical malpractice case mediated by Richard Strauss.&nbsp; He was initially recommended by defense counsel, and while that typically would be cause for concern, since I had a prior positive experience with Richard, I agreed to mediate this case with him.",
        "Richard was thoroughly prepared for this mediation, having read all of the medical and operative reports, expert reports, depositions and other discovery documents.&nbsp; He used that preparation to put my clients at ease, knowing he really knew the case, and he also proved he knew both the strengths and weaknesses of all sides to the case.&nbsp; By demonstrating this in both his opening comments when all parties were present, as well as when he met privately with me and my clients, he gained a great deal of credibility with me, my clients, and no doubt, the defense side.&nbsp; This enabled him to take a very active role in the mediation, and he was not simply a messenger of demands and offers, but he was a driving force in the negotiating process.&nbsp; I believe this helped all sides examine the case fairly and honestly.",
        "Richard's approach of open discussion was helpful in us getting a complicated case, with multiple parties, resolved in a one day mediation session.&nbsp; He also recognized that, like all good settlements, all of the parties were both a little happy, but also a little unhappy with the outcome-which usually means a fair resolution was achieved.&nbsp; It is always gratifying when my client gets a good result and understands the process and therefore that this was a good result.&nbsp; Richard was instrumental in fostering the atmosphere that ended with just that result.",
        "It is also very impressive that, despite our case not being in his 'home jurisdiction', Richard was able to understand the nuances of our local law, the relative value of a case where the case is venued, and he was also very adept at understanding how those factors provided additional strengths or weaknesses for the parties.",
        "In sum, I was very pleased with Richard Strauss as a mediator, and I would recommend him to colleagues and use again in other cases."
      ]
    },
    {
      "author": "Louis J. DeVoto",
      "city": "Cherry Hill",
      "testimonial": [
        "I want to take the time to personally thank you again for doing such a great job with the mediation last week.&nbsp; Although I had never used your services before, I had received excellent feedback and welcomed the opportunity to try you as a Mediator.",
        "I could not have been more satisfied with the mediation and the result you achieved fro my client including a very good settlement and an end to protracted litigation.&nbsp; I was impressed that you had complete control of the proceeding and fully understood all of the facts and legal issues.&nbsp; I was also impressed with your willingness to privately give us your opinions on how you viewed the evidence and how you thought the issues and trial would play out in court.&nbsp; Your medical experience and background in the hospital and rehabilitation setting was invaluable.&nbsp; My client and I both respected your opinions and appreciated your willingness to provide your insight into the case.&nbsp; With you, it was more than just a numbers game and my client felt like he had his day in court. I will gladly use your services again.",
        "Thanks for doing a fine job."
      ]
    },
    {
      "author": "Adam M. Kotlar",
      "city": "Cherry Hill",
      "testimonial": [
        "I wanted to take this opportunity to thank you for your assistance in resolving my client's significant personal injury claim through mediation.&nbsp; Although I must say that I was very tentative at first to utilize your services, given your distance from my office in Cherry Hill, New Jersey, that obstacle was quickly overcome by your policy of not charging any travel time or expense.",
        "The concern that I had that you might have a defense preference given your prior claims management history was quickly eradicated when we had the opportunity to caucus independent of the defendant's counsel and the defendants in our case.&nbsp; Similarly, I was very impressed with your grasp of the complicated factual history of my client's personal injury matter.&nbsp; I can honestly say that at some points I thought you had as solid of a grasp of the facts of my client's case as I wielded myself!&nbsp; Your level of preparation was simply exemplary.",
        "In sum, I can honestly say that I am very happy to have had the opportunity to have you mediate this significant and difficult personal injury claim.&nbsp; Not only would I recommend you wholeheartedly to other attorneys, I will most assuredly keep you in mind for my own future mediation cases in the future.&nbsp; Should any of your potential mediation clients have any questions or concerns, you are certainly welcome to give them my contact information and I will be more than happy to clarify any issues which I am able to.",
        "I look forward to working with you again in the future."
      ]
    },
    {
      "author": "Ronald B. Grayzel",
      "city": "Edison",
      "testimonial": [
        "I would like to take this opportunity to recommend Richard Strauss, Esq. as a mediator in your case.&nbsp; My recommendation is based upon my experience with Richard in his role as a mediator in settling a podiatric malpractice case.&nbsp; My partner, Adam Rothenberg, Esq., has also had two matters with Richard that were successfully settled.",
        "After those close of discovery in my podiatric malpractice case, defense counsel requested mediation but indicated that the carrier would only accept Richard as a mediator.&nbsp; The case had been hard fought and relations with defense counsel were contentious at times.&nbsp; Richard mediates claims for this carrier in multiple states.&nbsp; This request immediately raised a red flag.&nbsp; The mediations I have participated in have generally been conducted by retired New Jersey Superior Court judges that defense counsel and I have agreed to.&nbsp; My limited prior experience with mediations conducted by mediators demanded by insurance carriers have not been positive ones.",
        "I consulted with my partner who advised me that his two experiences with Richard had been successful.&nbsp; I checked with my colleagues in the plaintiff's bar and Richard also received excellent reviews.&nbsp; My client agreed to the mediation with Richard.&nbsp; The paperwork that this mediator requests is modest and focused.&nbsp; The submission requires that the plaintiff's lawyer provide a detailed analysis of the strengths and weaknesses of the case.",
        "The process that Richard used was appreciated very much by my clients.&nbsp; Richard met with plaintiffs and me privately at the outset of the mediation.&nbsp; He gave a detailed explanation of the process and answered questions.&nbsp; Richard then conveyed a joint meeting of all the parties and counsel to go over the ground rules.&nbsp; The next step was to solicit an offer in response to my client's pre-mediation demand.&nbsp; Richard went to a separate room to meet with the carrier's representative and defense counsel.",
        "When Richard returned to our conference room, he presented the offer.&nbsp; He proceeded to a detailed analysis of the plaintiff's claim and checked with us to ensure that he had covered all the points.&nbsp; Richard then explained the weaknesses in our position to plaintiffs.&nbsp; He did the presentation in such a way as to inform but not offend my clients.&nbsp; I found his analysis to be excellent as he pointed out some factors that I had not fully considered and evaluated.",
        "The mediation lasted 3 1/2 hours.&nbsp; Incremental offers were modest and the process was painful at times.&nbsp; Richard remained patient and fostered the process along step by step.&nbsp; Finally, when positions had narrowed, the mediator pushed the parties to a fair resolution of the case.&nbsp; Frankly, I was surprised at the outcome and that Richard was able to obtain it.&nbsp; Based on my experience, I am certainly willing to use Richard again."
      ]
    },
    {
      "author": "Adam L. Rothenberg",
      "city": "Edison",
      "testimonial": [
        "This letter is in follow-up to our Mediation which occurred on March 27, 2009.&nbsp; I want to thank you for your services and professionalism.&nbsp; I was more than pleasantly surprised.",
        "As you can imagine, any time an insurance carrier suggests someone you have never heard of to act as&nbsp; mediator, my suspicions are raised.&nbsp; When I read that you were a claims manager and worked in the healthcare industry, you might imagine the trepidation and suspicion that arose.&nbsp; Nevertheless, after speaking on the telephone with you and another plaintiff's attorney, we decided to give it 'a shot'.",
        "I have to say that I was very pleasantly surprised.&nbsp; Your preparation, knowledge of the facts in our case, understanding of the issues for both parties and identification of issues for both parties were as thorough as one could possibly expect.&nbsp; The preparation that you did was as good as anyone and your insights I thought were very helpful to both parties.",
        "More importantly, the way in which the Mediation was run from the opening through negotiations to conclusion was professional, neutral and consistently moved us to the possibility of settlement.&nbsp; While I was satisfied with the ultimate number that we actually did settle upon, I believe that even if the process had not resulted in settlement I would have been satisfied with the services you supplied.",
        "My clients were comfortable with your approach.&nbsp; You did not pressure us and honored my relationship with my clients.&nbsp; Moreover, I appreciate the fact that you did not seem to have your own agenda but was always attempting to simply move the parties&nbsp;towards a mutual agreement rather than one which reflected your own values.",
        "You have some novel approaches to Mediation.&nbsp; I have recommended you to others in my firm and would be willing to recommend you to others.&nbsp; I wish you the best and appreciate your fine work in this matter."
      ]
    },
    {
      "author": "Michael A. Brusca",
      "city": "Ewing",
      "testimonial": [
        "To Whom It May Concern:",
        "I write this letter to recommend Richard Strauss as a mediator. I am a plaintiff's attorney focusing on long-term care neglect and abuse claims for over 10 years. I have retained Richard many times over the past 10 years as a mediator, at both my suggestion and the defense's. I would not hesitate to use or recommend Richard as a mediator.",
        "In my experience, Richard has a good demeanor with clients, prepares extensively, is extremely knowledgeable in the area, understands the issues, has valuable opinions, and will follow-up when necessary.",
        "Richard's demeanor is well suited to these types of emotional cases. He has a respectful demeanor even when discussing weaknesses of the case. This is a difficult needle to thread, which he can do successfully.",
        "Richard is very prepared. In my experiences, he carefully read the materials sent and understood the claim well. His knowledge of the case gave my clients a significant measure of comfort with his recommendations.",
        "Richard is knowledgeable in the area and understands the issues. He has worked as a mediator for long-term care cases for a long time. He quickly grasps the relevant issues. My submissions to him are easier to produce, without having to extensively explain complex data, medical issues, and long-term care basics.",
        "Richard's opinions are valuable. An objective review of the claim by an unbiased, knowledgeable, and intelligent attorney is very helpful, especially regarding potential problem issues with my case. While I ultimately rely on my own judgments regarding a claim, I am always interested in another knowledgeable person's opinion. When retained, Richard did an excellent job of highlighting issues for consideration in my cases — at times things I had not considered.",
        "Lastly, Richard will continue to work towards resolution if the claim does not resolve at the mediation. I have had cases with Richard as mediator that settled weeks and months after the initial mediation. In those instances he continued to contact the parties involved and continue to drive the claim to resolution.",
        "Please feel free to call me to discuss."
      ]
    },
    {
      "author": "Richard A. Gantner",
      "city": "Oakland",
      "testimonial": [
        "I am writing to express my unqualified recommendation of Richard M. Strauss, Esq. as a mediator.",
        "Recently, Mr. Strauss was instrumental in bringing a resolution to a very contentious and complex podiatric malpractice case.&nbsp; He was recommended by the insurance carrier's claim representative.&nbsp; I agreed, thinking it could not hurt the case to mediate.&nbsp; To my very pleasant surprise, Mr. Strauss provided just the help we needed to settle the case.&nbsp; Mr. Strauss was evenhanded, exhibited a high degree of expertise in the subject matter, and demonstrated am outstanding level of preparation and understanding of the key issues in the case.",
        "This mediator's approach to resolving disputes is unique.&nbsp; In particular, his opening comments are specifically directed toward creating a conciliatory environment necessary for compromise and resolution.&nbsp; As we proceeded through the mediation, Mr. Strauss discussed and thoroughly analyzed each issue in the case.&nbsp; Issues evolved and narrowed as the day progressed and Mr. Strauss consistently displayed his willingness to offer options and suggestions throughout the entire settlement negotiation phase of the mediation.",
        "Both my client and his daughter, who attended the mediation, told me that they were extremely comfortable having Richard M. Strauss mediate the case.",
        "I was initially concerned, when Mr. Strauss' name was mentioned, about using a mediator who is not a New Jersey lawyer.&nbsp; It took only a short amount of time before I recognized that Mr. Strauss can mediate effectively in any jurisdiction.",
        "I am happy to recommend Richard M. Strauss and will be pleased to answer any questions."
      ]
    },
    {
      "author": "Martin F. Kronberg",
      "city": "Union",
      "testimonial": [
        "I am writing this Letter of Recommendation with regard to your services as a mediator in the case which settled at mediation recently.&nbsp; When I received a request by defense counsel to mediate at the early stages of the case, I thought it might be worth a try although I was basically skeptical.&nbsp; I must say I was pleasantly surprised.",
        "Your excellent understanding of nursing home procedures enabled you to point out the strengths and weaknesses in both sides positions.&nbsp; Your patient ability to communicate with my client was also very helpful in consummating a settlement.",
        "In sum, I highly recommend you as a mediator in this type of case."
      ]
    }
  ]
}
