{
  "state": "New York",
  "testimonials": [
    {
      "author": "Kevin P. Wicka",
      "city": "Buffalo",
      "testimonial": [
        "Thank you again for your efforts in assisting us in reaching a resolution of this matter.&nbsp; As you know, I was very impressed with your preparation and the manner in which you handled the initial session-even though the other side had taken a frustrating position at that time.&nbsp; I strongly encouraged new defense counsel to use you again in the second session.&nbsp; We appreciated your efforts in that session as well.",
        "I will certainly pass on your information to my colleagues."
      ]
    },
    {
      "author": "Deborah N. F. Truhowsky",
      "city": "Jericho",
      "testimonial": [
        "Our office had the pleasure of meeting and working with Richard M. Strauss in a mediation.",
        "Mr. Strauss' professionalism and dedication to bring parties together was effective in getting our case resolved.&nbsp; We were extremely impressed with the manner in which the process was conducted and quickly realized his unique background in the Health Care Industry and familiarity with standards of care.&nbsp; Mr. Strauss brings a level of expertise and knowledge apart from most other mediators.",
        "Mr. Strauss' intense level of preparation and understanding of the key issues enabled the process to move quickly.&nbsp; The technique used to dispense with opening statements and presentations, although unconventional for us, was effective in maintaining open dialogue between parties.&nbsp; Lastly and most importantly, his approach was objective and fair-handed throughout the mediation.",
        "In closing, our office would without hesitation utilize his services in the future and recommend him to others."
      ]
    },
    {
      "author": "Brett R. Leitner",
      "city": "Melville",
      "testimonial": [
        "I recently had the pleasure of mediating a nursing home case with Richard Strauss.",
        "As a plaintiff's attorney, I was initially hesitant to use a mediator that 1) came from outside of New York, and 2) appeared to have a defense-oriented background.&nbsp; However, Mr. Strauss came highly recommended, and we proceeded with the mediation.&nbsp; Mr. Strauss' knowledge of this very specialized subject area, impeccable preparation regarding the issues at hand in our specific case, and dedication to resolving the matter were very effective in getting our case resolved.",
        "Mr. Strauss' level of preparation and knowledge of the specific subject area of long term care litigation permitted the mediation to quickly proceed to the negotiation phase.&nbsp; Once there, Mr. Strauss displayed very creative negotiation skills, and offered various options and suggestions to both parties which effectively helped to bring the matter to conclusion.",
        "In sum, I found Mr. Strauss to be very objective and even-handed during the mediation.",
        "I would mediate with Mr. Strauss again without hesitation, and recommend him to other attorneys."
      ]
    },
    {
      "author": "Eli A. Fuchsberg",
      "city": "New York City",
      "testimonial": [
        "We successfully mediated a case with Richard Strauss in January, 2020. &nbsp; This letter is to recommend Mr. Strauss' mediation services.",
        "The case at issue involved a fall at a nursing home resulting in a fractured femur.&nbsp; With a trial date upcoming defense counsel suggested we use Richard Strauss and his Company, MediateOne, Inc.&nbsp; While hesitant to use an unfamiliar mediator, Mr. Strauss proved to be an excellent choice.",
        "Mr. Strauss came prepared to the mediation having reviewed and summarized the mediation statements submitted.&nbsp; Moreover, Mr. Strauss has substantial knowledge of nursing home cases and Public Health Law.&nbsp; Additionally, Mr. Strauss was able to work with the client and develop a level of trust that was helpful in resolving such a personal matter.",
        "Please feel free to contact me at (212) 869-3500 with any questions regarding Richard Strauss' mediation services.&nbsp; I fully recommend his services."
      ]
    },
    {
      "author": "Christopher Joslin",
      "city": "New York City",
      "testimonial": [
        "Thank you again for your assistance in bringing this case to a close.&nbsp; Your knowledge of the case, expertise concerning the subject matter and affable personality were all key to getting this matter settled.&nbsp; I look forward to seeing you again, and will recommend you highly to my colleagues."
      ]
    },
    {
      "author": "James G. Kapralos",
      "city": "Port Washington",
      "testimonial": [
        "As a Plaintiff attorney, who has been representing Plaintiffs over the past few years in long term care cases, I am pleased to recommend Richard M. Strauss as a mediator in this very specialized industry.</p> <p>While I was initially very reluctant to have a mediator out of Atlanta come to New York to mediate for me, I have found that he has a very unique background in the industry as well as being a very proficient mediator.</p> <p>In each case he has mediated for me, he has always been extremely well prepared, and has been able to identify the strengths and weaknesses with unerring accuracy.&nbsp; This preparation allows him to work through the issues much quicker than other mediators, and thus shift the mediation into the negotiation phase much faster than his colleagues, to the benefit of all participants.",
        "He has also shown himself to be a very skilled negotiator, and unlike other mediators, who just run numbers back and forth between the parties, he provides the parties suggestions, recommendations and options throughout the process.&nbsp; Finally, his willingness to remain involved post-mediation in those cases which haven't settled at mediation, with all services being provided on a flat fee basis, is quite refreshing, as my experience has been that his commitment post-mediation is as strong as it is during the mediation.",
        "It is for those reasons I would strongly recommend Richard M. Strauss, not only to my colleagues in the Plaintiff's bar, but also to defense attorneys and claim representatives who desire to have a true professional mediate their nursing home disputes."
      ]
    },
    {
      "author": "Paul J. Goldstein",
      "city": "Poughkeepsie",
      "testimonial": [
        "I would wholeheartedly endorse Richard M. Strauss, Esq. as a mediator.&nbsp; I have thus far used him in two mediations.&nbsp; One settled soon after the mediation as a result of his efforts, and the other settled at the mediation, after many hours in which he refused to give up.",
        "Strauss helped me and the family that I represented in successfully resolving the mediation of the nursing home case.&nbsp; Both my client and I were impressed with his working detailed knowledge of the matter at hand, and his ability to grasp the issues for both sides.&nbsp; We found him sympathetic, empathetic, and yet,  realistic.&nbsp; He persevered over many hours, even when both myself and my client were ready to quit, he insisted that we carry on.&nbsp; Miraculously, he somehow got the insurance company to an acceptable number, which settled the case.",
        "I would strongly recommend him.&nbsp; In fact, I have requested on several pending cases, that the defendants use his services.&nbsp; Not only did I find him knowledgable in the matter at hand, I found him practical and fair-minded as well.&nbsp; Additionally,  his services come at a very reasonable cost, which is always a concern in these matters.",
        "Very truly yours,"
      ]
    },
    {
      "author": "Keith J. Ahlers",
      "city": "White Plains",
      "testimonial": [
        "I want to thank you for your help as a mediator in regard to the&hellip;matter.",
        "As you are aware, as a plaintiff's lawyer, I was unsure of your impartiality given your background was primarily on the defense side.",
        "However, upon meeting with you and discussing the matter, I was comfortable that you would approach this case fairly and impartially.",
        "I was equally impressed by the degree of your preparation and understanding of the materials associated with this case.",
        "I would not hesitate to recommend your services to either party.",
        "It was a pleasure working with you."
      ]
    }
  ]
}
